docs: switch to d2
